#+TITLE: Notación Asociativa para un Curso de Álgebra Lineal (NAcAL)
#+SUBTITLE: [[https://github.com/mbujosab/nacallib]] (Versión:  0.2.0)
#+AUTHOR: Marcos Bujosa
#+LANGUAGE: es-es
#+STARTUP: show5levels

#+OPTIONS: H:5
# +OPTIONS: toc:5
# +OPTIONS: toc:nil


#+LATEX_CLASS: report
#+LaTeX_HEADER: \usepackage{nacal}
#+LATEX_HEADER: \usepackage[spanish]{babel}
#+LaTeX_HEADER: \usepackage{pdfpages}
#+LaTeX_HEADER: \usepackage{parskip}

# Para que no ejecute todo el código al exportar a pdf
#+PROPERTY: header-args :eval never-export
#+CALL: NombreEnChunksDeCodigo()


\maketitle

# +TOC: headlines 4

# |                 <c>                  |
# |            Versión 0.2.0             |
# | [[https://github.com/mbujosab/nacallib]] |

#+BEGIN_SRC jupyter-python  :results none :exports none
#from nacal import *
from AlgLin import *

def displaymath(t):
    return '$$' + t + '$$'

def dmath(t):
    return '$$' + latex(t) + '$$'

def math(t):
    return '$' + latex(t) + '$'

def dprint(t):
    return '=' + str(t) + '='

a,b,c,x,y,z = sympy.symbols('a b c x y z')

#+END_SRC

** La clase ~Sistema~

En el [[https://mbujosab.github.io/CursoDeAlgebraLineal/libro.pdf#chapter.1][libro]] del curso se dice que
\begin{center}
  Un \emph{sistema} es una lista ordenada de objetos.
\end{center}
Aunque Python ya posee =listas=, vamos a crear nuestra propia clase
denominada =Sistema=. De esta manera podremos implementar los métodos
descritos en el curso para los sistemas (que no son los mismos que
Python define para las =listas=). Por añadidura adecuaremos la
representación de los sistemas a la empleada en el [[https://mbujosab.github.io/CursoDeAlgebraLineal/libro.pdf#chapter.1][libro]], donde los
sistemas genéricos se muestran entre /corchetes/ y con los elementos
de la lista /seguidos de/ `` =;= ''.[fn:: Como los vectores y las
matrices también son sistemas, crearemos para ellos subclases con las
respectivas representaciones tal y como se describen en el [[https://mbujosab.github.io/CursoDeAlgebraLineal/libro.pdf][curso]].]

La clase =Sistema= posee un atributo llamado =lista=, que es una
=list= de Python con la lista de objetos que componen el
=Sistema=. Una característica de un =Sistema= es que cada uno de sus
elementos será mostrado con su propia representación.  Por ejemplo, el
=Sistema=
#+BEGIN_SRC jupyter-python :exports code :results none
Sistema([ Vector([1,2,3]), I(2), T({1,2}) ]) 
#+END_SRC
contiene un vector de \R[3], la matriz identidad 2 por 2 y una
transformación intercambio entre las componentes 1 y 2 de un sistema;
y en un Notebook de Jupyter lo veremos así
#+BEGIN_SRC jupyter-python :exports results :results raw :results output replace
dmath( Sistema([ Vector([1,2,3]), I(2), T({1,2}) ]) )
#+END_SRC

#+RESULTS:
$$\begin{bmatrix}\begin{pmatrix}1\\ 2\\ 3\end{pmatrix};& \left[ \begin{array}{cc}1&0\\0&1\\ \end{array} \right];& \underset{\left[\mathbf{1}\rightleftharpoons\mathbf{2}\right]}{\pmb{\tau}};\end{bmatrix}$$

\noindent
(es decir, con la misma notación descrita en el curso de Álgebra Lineal).

Los ~Sistemas~ y las =listas= de Python no solo se diferencian en el
modo de representar los objetos que contienen, también en muchos de
sus métodos. Aunque algunos son comunes (en ciertos aspectos un
=Sistema= se comporta como una =list=) otros son específicos de los
=Sistemas=, y otros se han modificado para poder reservar los símbolos
de las operaciones algebraicas. Por ejemplo, las =listas= de Python se
concatenan con ``+'', pero los =Sistemas= se concatenan con el método
=concatena()=. Así reservamos el símbolo ``+'' para sumar =Sistemas=
componente a componente como se hace en Álgebra Lineal. Con ello
buscamos que lo que veamos y escribamos en un Notebook de Jupyter sea
lo más parecido posible a lo que vemos y escribimos en el [[https://mbujosab.github.io/CursoDeAlgebraLineal/libro.pdf#chapter.1][curso de
Álgebra Lineal]].

\newpage

***** Sustitución de variables simbólicas. 

#+name: Sustitución de variables simbólicas
      #+BEGIN_SRC python :noweb yes

def subs(self, reglasDeSustitucion=[]):
    """ Sustitución de variables simbólicas """
    reglas = CreaLista(reglasDeSustitucion)
    self.lista = [ sympy.S(elemento).subs(CreaLista(reglas)) for elemento in self.lista ]
    return self

#+END_SRC

El argumento es una lista de [[https://docs.sympy.org/latest/tutorials/intro-tutorial/basic_operations.html][reglas de sustitución]] formadas por pares
=(símbolo, valor)=; por ejemplo ~[(a,2), (b,0), (c,a)]~.

# a,b,c = sympy.symbols('a b c')

#+BEGIN_SRC jupyter-python :exports code :results raw :results silent
A = Sistema([ a, b, c ])
A.subs( [(a,222), (b,sympy.sqrt(5)), (c,a)] )
#+END_SRC

#+BEGIN_SRC jupyter-python :exports results :results raw :results output replace
dmath(A)
#+END_SRC

#+RESULTS:
$$\left[ \begin{array}{ccc}222;& \sqrt{5};& a;\end{array} \right]$$

Cuando hay una única regla de sustitución, basta escribir como
argumento el correspondiente par. Por ejemplo: ~A.subs( (a,0) )~.

***** Métodos para [[https://docs.sympy.org/latest/tutorials/intro-tutorial/simplification.html][simpificar]] expresiones simbólicas 

Simplificación de las expresiones simbólicas contenidas en la ~lista~ de un ~Sistema~

#+name: Simplificación de expresiones simbólicas
#+BEGIN_SRC python :noweb yes

def simplify(self):
    """ Simplificación de expresiones simbólicas """
    self.lista = [ sympy.S(elemento).simplify() for elemento in self.lista ]
                                                               
def factor(self):
    """ Factorización de expresiones simbólicas """
    self.lista = [ sympy.S(elemento).factor() for elemento in self.lista ]

#+END_SRC

#+BEGIN_SRC jupyter-python :exports code :results silent
x, y, z = sympy.symbols('x y z')
A    = Sistema([ (x**3 + x**2 - x - 1)/(x**2 + 2*x + 1),   x**2*z + 4*x*y*z + 4*y**2*z])
#+END_SRC

#+BEGIN_SRC jupyter-python :exports results :results raw :results output replace
dmath(A)
#+END_SRC

#+RESULTS:
$$\left[ \begin{array}{cc}\frac{x^{3} + x^{2} - x - 1}{x^{2} + 2 x + 1};& x^{2} z + 4 x y z + 4 y^{2} z;\end{array} \right]$$

#+BEGIN_SRC jupyter-python :exports code :results raw :results silent
A.simplify()
#+END_SRC

#+BEGIN_SRC jupyter-python :exports results :results raw :results output replace
dmath(A)
#+END_SRC

#+RESULTS:
$$\left[ \begin{array}{cc}x - 1;& z \left(x^{2} + 4 x y + 4 y^{2}\right);\end{array} \right]$$

**** Ejemplo de representación de un ~Sistema~
   :PROPERTIES:
   :header-args:    :tangle no
   :END:

Veamos la representación =str= de un sistema =A= con tres elementos:
#+BEGIN_SRC jupyter-python :exports code :results silent 
A = Sistema([ 2, fracc(a,b), sympy.sqrt(5), ])
print( A )
#+END_SRC

#+BEGIN_SRC jupyter-python :exports results :results raw # :results output replace 
dprint( A )
#+END_SRC

#+RESULTS:
=[2; a/b; sqrt(5);]=

Si incluimos una separación visual detrás de la segunda componente de
=A= su representación =str= es:
#+BEGIN_SRC jupyter-python :exports code :results silent
A.ccol({2})
print( A )
#+END_SRC

#+BEGIN_SRC jupyter-python :exports results :results raw :results output replace
dprint( A )
#+END_SRC

#+RESULTS:
=[2; a/b;|sqrt(5);]=

Sin embargo, la representación =repr= no muestra la barra vertical de
separación:
#+BEGIN_SRC jupyter-python :exports code :results silent
repr( A )
#+END_SRC

#+BEGIN_SRC jupyter-python :exports results :results raw :results output replace
dprint( repr(A) )
#+END_SRC

#+RESULTS:
=Sistema([2; a/b; sqrt(5);])=

La barra vertical de separación visual sí se muestra en la
representación =latex= (es la representación empleada por defecto en
los Notebooks de Jupyter y en el material del curso de Álgebra
Lineal):
#+BEGIN_SRC jupyter-python :exports both
pinta(A)
#+END_SRC

#+RESULTS:
:RESULTS:
$\displaystyle \left[ \begin{array}{cc|c}2;& \frac{a}{b};& \sqrt{5};\end{array} \right]$
:END:

**** Ejemplo de representación con un ~Sistema~ más complejo
   :PROPERTIES:
   :header-args: :tangle no
   :header-args: :results output replace
   :END:

Únicamente cuando un =Sistema= tiene una estructura muy sencilla las
tres formas de representación de ~Sistemas~ son prácticas. Por
ejemplo, la representación =str= se ve mal cuando el sistema contiene
objetos que son complicados de representar (por ejemplo matrices
dentro de otros sistemas). Por otra parte, aunque la representación
=repr= indica claramente cuál es el tipo de cada objeto, es difícil
ver qué contiene cada uno de los objetos. La representación =latex=
es, con diferencia, la más fácil de interpretar de un simple vistazo.

En el siguiente ejemplo, con =.ccol({1})= indicamos que el primer
elemento del sistema debe estar visualmente separado del resto.

#+BEGIN_SRC jupyter-python :exports code :results silent
a,b,c = sympy.symbols('a b c')
vv = Vector([1,2,3])
Z = Sistema( [ Vector([6,8,10],rpr='fila').ccol({2}), vv , 1492] ) 
ZZ = Sistema([ Z, 'Hola', Matrix([Vector([0,sympy.pi,fracc(a,2)]),Vector([0,0,0])])  ]).ccol({1})
print(ZZ)
repr(ZZ)
ZZ
#+END_SRC

#+BEGIN_SRC jupyter-python :exports results :results raw :results output replace
dprint( ZZ )
#+END_SRC

#+RESULTS:
=[[(6, 8,|10,); (1, 2, 3,); 1492;];|Hola; |  0   0|\n| pi   0|\n|a/2   0|;]=

#+BEGIN_SRC jupyter-python :exports results :results raw :results output replace
dprint( repr(ZZ) )
#+END_SRC

#+RESULTS:
=Sistema([Sistema([Vector([6, 8, 10]); Vector([1, 2, 3]); 1492;]); 'Hola'; Matrix([Vector([0, pi, a/2]), Vector([0, 0, 0])]);])=

#+BEGIN_SRC jupyter-python :exports results :results raw :results output replace
pinta(ZZ)
#+END_SRC

#+RESULTS:
$\displaystyle \left[ \begin{array}{c|cc}\left[ \begin{array}{ccc}\left( \begin{array}{c}6\\8\\ \hline 10\\ \end{array} \right);& \left( \begin{array}{c}1\\2\\3\\ \end{array} \right);& 1492;\end{array} \right];& \mathtt{\text{Hola}};& \left[ \begin{array}{cc}0&0\\\pi&0\\\frac{a}{2}&0\\ \end{array} \right];\end{array} \right]$


\clearpage

**** Ejemplo de representación de un ~BlockV~
   :PROPERTIES:
   :header-args: :tangle no
   :header-args: :results output replace
   :END:

Veamos la representación de un =BlockM= cuya lista contiene una matriz
dos por tres y tres números.
#+BEGIN_SRC jupyter-python :exports code :results silent
BV = BlockV([Matrix([[1,2,3],[4,5,6]]), 1,0,0])
#+END_SRC

La representación =str= es no es práctica en este caso, pues su
elemento =Matrix= necesita de un salto de línea, por lo que la
visualización algo deficiente:
#+BEGIN_SRC jupyter-python :exports results :display text/plain
# :results raw :results output replace
dprint(BV) 
#+END_SRC

#+RESULTS:
:RESULTS:
=(|1 2 3|\n|4 5 6|, 1, 0, 0,)=
:END:

La representación =repr= es mejor, pero resulta difícil leer 
qué objetos son elementos de otros:
#+BEGIN_SRC jupyter-python :exports results :results raw :results output replace
dprint( repr(BV) )
#+END_SRC

#+RESULTS:
=BlockV([Matrix([Vector([1, 4]), Vector([2, 5]), Vector([3, 6])]), 1, 0, 0])=

La representación =latex= es la mejor:
#+BEGIN_SRC jupyter-python :exports results :results raw :results output replace
pinta( BV )
#+END_SRC

#+RESULTS:
$\displaystyle \left( \begin{array}{c}\left[ \begin{array}{ccc}1&2&3\\4&5&6\\ \end{array} \right]\\1\\0\\0\\ \end{array} \right)$

y también la podemos usar en horizontal:
#+BEGIN_SRC jupyter-python :exports results :results raw :results output replace
BV.rpr='fila'
pinta( BV )
#+END_SRC

#+RESULTS:
$\displaystyle \left( \begin{array}{cccc}\left[ \begin{array}{ccc}1&2&3\\4&5&6\\ \end{array} \right],& 1,& 0,& 0,\\ \end{array} \right)$

*********** COMMENT Ejemplo descartado                             :noexport:
Repetimos aquí el último ejemplo de representación de la clase
=Sistema= pero en este caso en forma de =BlockV=.  Fíjese que al
disponer los elementos en vertical en la representación =latex=, es
ligeramente más fácil entender la estructura del sistema.
#+BEGIN_SRC jupyter-python :exports code :results silent
vv = Vector([1,2,3])
Z = Sistema( [ Vector([6,8,10],rpr='fila').ccol({2}), vv , 1492] )  
ZZ = BlockV([ Z, 'Hola', Matrix([Vector([0,sympy.pi,fracc(a,2)]),Vector([0,0,0])])  ]).ccol({1})
print(ZZ)
repr(ZZ)
ZZ
#+END_SRC

#+BEGIN_SRC jupyter-python :exports results :results raw
# :results output replace
pinta( BV )
#+END_SRC

#+RESULTS:
$\displaystyle \left( \begin{array}{c}\left[ \begin{array}{ccc}1&2&3\\4&5&6\\ \end{array} \right]\\1\\0\\0\\ \end{array} \right)$

#+BEGIN_SRC jupyter-python :exports results :results raw :results output replace
dprint( repr(ZZ) )
#+END_SRC

#+RESULTS:
=BlockV([Sistema([Vector([6, 8, 10]); Vector([1, 2, 3]); 1492;]), 'Hola', Matrix([Vector([0, pi, a/2]), Vector([0, 0, 0])])])=

#+BEGIN_SRC jupyter-python :exports results :results raw :results output replace
pinta(ZZ)
#+END_SRC

#+RESULTS:
$\displaystyle \left( \begin{array}{c}\left[ \begin{array}{ccc}\left( \begin{array}{cc|c}6,& 8,& 10,\\ \end{array} \right);& \left( \begin{array}{c}1\\2\\3\\ \end{array} \right);& 1492;\end{array} \right]\\ \hline \mathtt{\text{Hola}}\\\left[ \begin{array}{cc}0&0\\\pi&0\\\frac{a}{2}&0\\ \end{array} \right]\\ \end{array} \right)$

*** Potencias e inversa de transformaciones elementales

Toda matriz de la forma $\TrC{\Mat{I}}$ ó $\TrF{\Mat{I}}$ es
invertible por ser producto de matrices elementales:
\begin{displaymath}
  \Transp{\TrC{\Mat{I}}}\Transp{\TrC[\InvOEg[k]\cdots\InvOEg[1]]{\Mat{I}}}=
  \TrC[\SOEg\cdot\InvOEg[k]\cdots\InvOEg[1]]{\Mat{I}}=
  \Mat{I};
\end{displaymath}
por lo que podemos denotar por $\Invp{\SOEg}$ a la sucesión de
$\InvOEg[k]\cdots\InvOEg[1]$. De este modo
\begin{displaymath}
  \Invp{\TrC{\Mat{I}}}=
  \TrC[\Invp*{\SOEg}]{\Mat{I}}=
  \TrC[\InvOEg[k]\cdots\InvOEg[1]]{\Mat{I}}.
\end{displaymath}
El siguiente método devuelve la potencia ~n~-ésima de una
transformación elemental y cuando ~n~ es $-1$ dicha potencia es la
inversa:
#+BEGIN_SRC jupyter-python :exports code :results silent
T([ (1, 2, 3), (fracc(1,3), 2), {1, 2} ]) **(-1)
#+END_SRC
#+BEGIN_SRC jupyter-python :exports results :display text/plain
# :results raw :results output replace
dprint( T([ (1, 2, 3), (fracc(1,3), 2), {1, 2} ]) **(-1) ) 
#+END_SRC
#+RESULTS:
:RESULTS:
=T([{1, 2}, (3, 2), (-1, 2, 3)])=
:END:
que en Jupyter veríamos como
#+BEGIN_SRC jupyter-python :exports results :results raw :results output replace
pinta( T([ (1, 2, 3), (fracc(1,3), 2), {1, 2} ]) **(-1) )
#+END_SRC

#+RESULTS:
$\displaystyle \underset{\begin{subarray}{c} \left[\mathbf{1}\rightleftharpoons\mathbf{2}\right]\\\left[\left(3\right)\mathbf{2}\right]\\\left[\left(-1\right)\mathbf{2}+\mathbf{3} \right]\end{subarray}}{\pmb{\tau}}$

Al implementar el método, definimos la potencia de manera recursiva
(con una función auxiliar =lambda=). Además, si ~n~ es cero,
devolveremos una transformación que no haga nada (identidad); por
ejemplo $\OEin{1}{1}$.

#+name: Potencia de una ~T~
#+BEGIN_SRC python :noweb no-export

def __pow__(self,n):
    """Calcula potencias de una T (incluida la inversa)"""
    <<Método auxiliar que calcula la inversa de una Transformación elemental>>    
    if not isinstance(n,int):
        raise ValueError('La potencia no es un entero')

    potencia = lambda T, n: T if n==1 else T & potencia(T, n-1)
    TransformacionElemental = potencia(self,abs(n)) if n!=0  else  T({1})
    
    return TransformacionElemental if n>0 else Tinversa(TransformacionElemental)
        
#+END_SRC

#+name: Método auxiliar que calcula la inversa de una Transformación elemental
#+BEGIN_SRC python

def Tinversa ( self ):
    """Calculo de la inversa de una transformación elemental"""
    operaciones = [                      abrv     if isinstance(abrv,set) else \
                    ( -abrv[0], abrv[1], abrv[2]) if len(abrv)==3         else \
                    (fracc(1,abrv[0]),   abrv[1])   for abrv in CreaLista(self.abreviaturas) ]

    return ~T( operaciones, rpr=self.rpr)

#+END_SRC

*** Métodos de representación para el entorno Jupyter

El método =html=, escribe el inicio y el final de un párrafo en html y
en medio del párrafo escribirá la cadena =TeX=; que contendrá el
código \LaTeX{} de las expresiones matemáticas que queremos que se
muestren en pantalla cuando usamos [[https://jupyter.org/][Jupyter Notebook]]. En el navegador,
la librería [[https://jupyter-notebook.readthedocs.io/en/stable/examples/Notebook/Typesetting%20Equations.html][MathJax]] de Javascript se encargará de convertir la
expresión \LaTeX{} en la grafía correspondiente.

#+name: Método html general
#+BEGIN_SRC python

def html(TeX):
    """ Plantilla HTML para insertar comandos LaTeX """
    return "<p style=\"text-align:center;\">$" + TeX + "$</p>"
    
#+END_SRC

El método =latex= general, intentará llamar al método =latex=
particular del objeto que se quiere representar (para todos los
objetos de esta librería se define su método de representación). Si el
objeto no tiene definido el método =latex=, entonces se emplea el
método ~sympy.latex()~ del módulo [[https://www.sympy.org/en/index.html][Sympy]]. Así,
#+BEGIN_SRC jupyter-python :results none
Sistema([ sympy.Rational(1.5, 3), fracc(2.4, 1.2), fracc(2, sympy.sqrt(2)) ]) 
#+END_SRC
donde las componentes se han escrito explícitamente como 
\begin{displaymath}
\frac{1.5}{3},\quad
\frac{2.4}{1.2},\quad\text{y}\quad
\frac{2}{\sqrt{2}},\quad
\end{displaymath}
será representado como
#+BEGIN_SRC jupyter-python  :exports results  
dmath( Sistema([ sympy.Rational(1.5, 3), fracc(2.4, 1.2), fracc(2, sympy.sqrt(2)) ])  )
#+END_SRC

#+RESULTS:
:RESULTS:
$$\left[ \begin{array}{ccc}\frac{1}{2};& 2;& \sqrt{2};\end{array} \right]$$
:END:

#+name: Método latex general
#+BEGIN_SRC python

def latex(a):
    """Método latex general"""
    try:
        return a.latex()
    except:
        return sympy.latex(a)
    
#+END_SRC

# Con el método =simplifica= se devuelven las expresiones
# simplificadas. Si el objeto es una tupla, lista o =Sistema=, se
# devuelve un objeto del mismo tipo, pero cuyos elementos han sido
# simplificados. Si =self= es otro tipo de objeto, entonces se
# ``sympifica'' con ~sympy.sympify(self)~, es decir, se transforma en un
# objeto del módulo [[https://www.sympy.org/en/index.html][Sympy]] para así poder ser simplificado con el método
# ~sympy.simpify()~.

Para visualizar un objeto en su formato \LaTeX{} definimos el método ~pinta~.

#+name: Pinta un objeto en Jupyter
#+BEGIN_SRC python

def pinta(data):
    """Muestra en Jupyter la representación latex de data"""
    display(Math(latex(data)))

#+END_SRC

Por ejemplo, compárese lo que devuelve ~pinta~
#+BEGIN_SRC jupyter-python :results output replace :results raw
pinta( Vector([sympy.sqrt(2), 0, fracc(3, 4) ]) )
#+END_SRC

#+RESULTS:
$\displaystyle \begin{pmatrix}\sqrt{2}\\ 0\\ \frac{3}{4}\end{pmatrix}$

con lo que devuelve ~print~
#+BEGIN_SRC jupyter-python :results output replace  :results raw
print( Vector([sympy.sqrt(2), 0, fracc(3, 4) ]) ) 
#+END_SRC

#+RESULTS:
Vector([sqrt(2), 0, 3/4])

